{
  "languages": [
    { "code": "en", "name": "English" },
    { "code": "cn", "name": "中文" },
    { "code": "de", "name": "Deutsch" },
    { "code": "es", "name": "Español" },
    { "code": "fr", "name": "Français" },
    { "code": "it", "name": "Italiano" },
    { "code": "ja", "name": "日本語" },
    { "code": "ko", "name": "한국어" },
    { "code": "pt", "name": "Português" },
    { "code": "ru", "name": "Русский" },
    { "code": "tr", "name": "Türkçe" },
    { "code": "uk", "name": "Українська" }
  ],
  "ui": {
    "title": {
      "en": "Pyxel MML Studio Manual",
      "cn": "Pyxel MML Studio 手册",
      "de": "Pyxel MML Studio Handbuch",
      "es": "Manual de Pyxel MML Studio",
      "fr": "Manuel de Pyxel MML Studio",
      "it": "Manuale di Pyxel MML Studio",
      "ja": "Pyxel MML Studio マニュアル",
      "ko": "Pyxel MML Studio 매뉴얼",
      "pt": "Manual do Pyxel MML Studio",
      "ru": "Руководство Pyxel MML Studio",
      "tr": "Pyxel MML Studio Kılavuzu",
      "uk": "Посібник Pyxel MML Studio"
    },
    "subtitle": {
      "en": "Manual for the {0} online MML creation tool.",
      "cn": "{0} 在线 MML 制作工具手册",
      "de": "Handbuch für das {0}-Online-MML-Erstellungstool.",
      "es": "Manual de la herramienta de creación MML en línea de {0}.",
      "fr": "Manuel de l'outil de création MML en ligne de {0}.",
      "it": "Manuale dello strumento di creazione MML online di {0}.",
      "ja": "{0} のオンラインMML制作ツールマニュアル",
      "ko": "{0} 온라인 MML 제작 도구 매뉴얼",
      "pt": "Manual da ferramenta de criação MML online do {0}.",
      "ru": "Руководство по онлайн-инструменту создания MML для {0}.",
      "tr": "{0} çevrimiçi MML oluşturma aracı kılavuzu.",
      "uk": "Посібник онлайн-інструменту створення MML для {0}."
    },
    "overview_title": {
      "en": "Overview",
      "cn": "概述",
      "de": "Überblick",
      "es": "Descripción general",
      "fr": "Présentation",
      "it": "Panoramica",
      "ja": "概要",
      "ko": "개요",
      "pt": "Visão geral",
      "ru": "Обзор",
      "tr": "Genel Bakış",
      "uk": "Огляд"
    },
    "overview_body": {
      "en": "Pyxel MML Studio is a browser-based chiptune music creation tool powered by Pyxel's NES-style sound engine. Enter melodies using MML (Music Macro Language) across up to 4 channels, and share your music via URL or QR code — all without installation.",
      "cn": "Pyxel MML Studio 是基于 Pyxel 的 FC 风格音频引擎的浏览器芯片音乐制作工具。使用 MML（Music Macro Language）在最多 4 个通道中输入旋律，并通过 URL 或二维码分享作品，无需安装。",
      "de": "Pyxel MML Studio ist ein browserbasiertes Chiptune-Musikerstellungstool, das auf Pyxels NES-Soundengine basiert. Geben Sie Melodien mit MML (Music Macro Language) auf bis zu 4 Kanälen ein und teilen Sie Ihre Musik per URL oder QR-Code — ganz ohne Installation.",
      "es": "Pyxel MML Studio es una herramienta de creación de música chiptune basada en navegador, impulsada por el motor de sonido estilo NES de Pyxel. Ingresa melodías usando MML (Music Macro Language) en hasta 4 canales y comparte tu música mediante URL o código QR, todo sin instalación.",
      "fr": "Pyxel MML Studio est un outil de création musicale chiptune dans le navigateur, basé sur le moteur sonore style NES de Pyxel. Entrez des mélodies en MML (Music Macro Language) sur jusqu'à 4 canaux et partagez votre musique par URL ou QR code, le tout sans installation.",
      "it": "Pyxel MML Studio è uno strumento di creazione musicale chiptune basato sul browser, alimentato dal motore audio in stile NES di Pyxel. Inserisci melodie usando MML (Music Macro Language) su fino a 4 canali e condividi la tua musica tramite URL o codice QR, tutto senza installazione.",
      "ja": "Pyxel MML Studioは、Pyxelのファミコンスタイルサウンドエンジンによるブラウザベースのチップチューン音楽制作ツールです。MML（Music Macro Language）で最大4チャンネルのメロディを入力し、URLやQRコードで作品を共有できます。インストールは不要です。",
      "ko": "Pyxel MML Studio는 Pyxel의 NES 스타일 사운드 엔진 기반 브라우저 칩튠 음악 제작 도구입니다. MML(Music Macro Language)로 최대 4채널의 멜로디를 입력하고, URL이나 QR 코드로 작품을 공유할 수 있습니다. 설치가 필요 없습니다.",
      "pt": "O Pyxel MML Studio é uma ferramenta de criação de música chiptune baseada em navegador, alimentada pelo motor de som estilo NES do Pyxel. Insira melodias usando MML (Music Macro Language) em até 4 canais e compartilhe sua música via URL ou código QR — tudo sem instalação.",
      "ru": "Pyxel MML Studio — это браузерный инструмент создания чиптюн-музыки на основе звукового движка Pyxel в стиле NES. Вводите мелодии с помощью MML (Music Macro Language) на до 4 каналах и делитесь музыкой через URL или QR-код — без установки.",
      "tr": "Pyxel MML Studio, Pyxel'in NES tarzı ses motoruyla çalışan tarayıcı tabanlı bir chiptune müzik oluşturma aracıdır. MML (Music Macro Language) ile 4 kanala kadar melodi girin ve müziğinizi URL veya QR kodu ile paylaşın — kurulum gerektirmez.",
      "uk": "Pyxel MML Studio — це браузерний інструмент створення чіптюн-музики на основі звукового рушія Pyxel у стилі NES. Вводьте мелодії за допомогою MML (Music Macro Language) на до 4 каналах і діліться музикою через URL або QR-код — без встановлення."
    },
    "layout_title": {
      "en": "Screen Layout",
      "cn": "屏幕布局",
      "de": "Bildschirmlayout",
      "es": "Diseño de pantalla",
      "fr": "Disposition de l'écran",
      "it": "Layout dello schermo",
      "ja": "画面構成",
      "ko": "화면 구성",
      "pt": "Layout da tela",
      "ru": "Макет экрана",
      "tr": "Ekran Düzeni",
      "uk": "Макет екрана"
    },
    "layout_body": {
      "en": "The screen consists of the control area at the top, channel input fields in the middle, and the URL/QR code output at the bottom.",
      "cn": "屏幕由顶部的控制区域、中间的通道输入栏和底部的 URL/二维码输出组成。",
      "de": "Der Bildschirm besteht aus dem Steuerungsbereich oben, den Kanaleingabefeldern in der Mitte und der URL-/QR-Code-Ausgabe unten.",
      "es": "La pantalla consta del área de control en la parte superior, los campos de entrada de canales en el medio y la salida de URL/código QR en la parte inferior.",
      "fr": "L'écran se compose de la zone de contrôle en haut, des champs de saisie des canaux au milieu et de la sortie URL/QR code en bas.",
      "it": "Lo schermo è composto dall'area di controllo in alto, dai campi di input dei canali al centro e dall'output URL/codice QR in basso.",
      "ja": "画面は上部のコントロールエリア、中央のチャンネル入力欄、下部のURL・QRコード出力で構成されています。",
      "ko": "화면은 상단의 컨트롤 영역, 중앙의 채널 입력란, 하단의 URL/QR 코드 출력으로 구성됩니다.",
      "pt": "A tela consiste na área de controle no topo, nos campos de entrada de canais no meio e na saída de URL/código QR na parte inferior.",
      "ru": "Экран состоит из области управления вверху, полей ввода каналов в середине и вывода URL/QR-кода внизу.",
      "tr": "Ekran, üstteki kontrol alanı, ortadaki kanal giriş alanları ve alttaki URL/QR kodu çıktısından oluşur.",
      "uk": "Екран складається з області керування зверху, полів введення каналів посередині та виводу URL/QR-коду внизу."
    },
    "layout_controls": {
      "en": "Control Area",
      "cn": "控制区域",
      "de": "Steuerungsbereich",
      "es": "Área de control",
      "fr": "Zone de contrôle",
      "it": "Area di controllo",
      "ja": "コントロールエリア",
      "ko": "컨트롤 영역",
      "pt": "Área de controle",
      "ru": "Область управления",
      "tr": "Kontrol Alanı",
      "uk": "Область керування"
    },
    "layout_controls_desc": {
      "en": "Contains playback buttons, links, and the runtime screen.",
      "cn": "包含播放按钮、链接和运行画面。",
      "de": "Enthält Wiedergabetasten, Links und den Ausführungsbildschirm.",
      "es": "Contiene botones de reproducción, enlaces y la pantalla de ejecución.",
      "fr": "Contient les boutons de lecture, les liens et l'écran d'exécution.",
      "it": "Contiene pulsanti di riproduzione, link e lo schermo di esecuzione.",
      "ja": "再生ボタン、リンク、実行画面を含みます。",
      "ko": "재생 버튼, 링크, 실행 화면을 포함합니다.",
      "pt": "Contém botões de reprodução, links e a tela de execução.",
      "ru": "Содержит кнопки воспроизведения, ссылки и экран выполнения.",
      "tr": "Oynatma düğmeleri, bağlantılar ve çalışma ekranını içerir.",
      "uk": "Містить кнопки відтворення, посилання та екран виконання."
    },
    "layout_runtime": {
      "en": "Runtime Screen",
      "cn": "运行画面",
      "de": "Ausführungsbildschirm",
      "es": "Pantalla de ejecución",
      "fr": "Écran d'exécution",
      "it": "Schermo di esecuzione",
      "ja": "実行画面",
      "ko": "실행 화면",
      "pt": "Tela de execução",
      "ru": "Экран выполнения",
      "tr": "Çalışma Ekranı",
      "uk": "Екран виконання"
    },
    "layout_channels": {
      "en": "Channel Input",
      "cn": "通道输入",
      "de": "Kanaleingabe",
      "es": "Entrada de canal",
      "fr": "Saisie des canaux",
      "it": "Input canali",
      "ja": "チャンネル入力",
      "ko": "채널 입력",
      "pt": "Entrada de canal",
      "ru": "Ввод каналов",
      "tr": "Kanal Girişi",
      "uk": "Введення каналів"
    },
    "layout_channels_desc": {
      "en": "Four channels (CH1–CH4) for entering MML, each with SOLO and MUTE buttons.",
      "cn": "四个通道（CH1–CH4）用于输入 MML，每个通道有 SOLO 和 MUTE 按钮。",
      "de": "Vier Kanäle (CH1–CH4) zur MML-Eingabe, jeweils mit SOLO- und MUTE-Tasten.",
      "es": "Cuatro canales (CH1–CH4) para ingresar MML, cada uno con botones SOLO y MUTE.",
      "fr": "Quatre canaux (CH1–CH4) pour saisir le MML, chacun avec des boutons SOLO et MUTE.",
      "it": "Quattro canali (CH1–CH4) per inserire MML, ciascuno con pulsanti SOLO e MUTE.",
      "ja": "MMLを入力する4つのチャンネル（CH1〜CH4）。各チャンネルにSOLO・MUTEボタンがあります。",
      "ko": "MML을 입력하는 4개의 채널(CH1–CH4). 각 채널에 SOLO 및 MUTE 버튼이 있습니다.",
      "pt": "Quatro canais (CH1–CH4) para inserir MML, cada um com botões SOLO e MUTE.",
      "ru": "Четыре канала (CH1–CH4) для ввода MML, каждый с кнопками SOLO и MUTE.",
      "tr": "MML girmek için dört kanal (CH1–CH4), her birinde SOLO ve MUTE düğmeleri bulunur.",
      "uk": "Чотири канали (CH1–CH4) для введення MML, кожен із кнопками SOLO та MUTE."
    },
    "layout_output": {
      "en": "URL / QR Code",
      "cn": "URL / 二维码",
      "de": "URL / QR-Code",
      "es": "URL / Código QR",
      "fr": "URL / QR code",
      "it": "URL / Codice QR",
      "ja": "URL・QRコード",
      "ko": "URL / QR 코드",
      "pt": "URL / Código QR",
      "ru": "URL / QR-код",
      "tr": "URL / QR Kodu",
      "uk": "URL / QR-код"
    },
    "layout_output_desc": {
      "en": "Displays the shareable URL and its QR code.",
      "cn": "显示可共享的 URL 及其二维码。",
      "de": "Zeigt die teilbare URL und ihren QR-Code an.",
      "es": "Muestra la URL compartible y su código QR.",
      "fr": "Affiche l'URL partageable et son QR code.",
      "it": "Mostra l'URL condivisibile e il suo codice QR.",
      "ja": "共有用URLとQRコードを表示します。",
      "ko": "공유 가능한 URL과 QR 코드를 표시합니다.",
      "pt": "Exibe a URL compartilhável e seu código QR.",
      "ru": "Отображает URL для публикации и его QR-код.",
      "tr": "Paylaşılabilir URL'yi ve QR kodunu görüntüler.",
      "uk": "Відображає URL для поширення та його QR-код."
    },
    "controls_title": {
      "en": "Controls",
      "cn": "控制",
      "de": "Steuerung",
      "es": "Controles",
      "fr": "Commandes",
      "it": "Controlli",
      "ja": "コントロール",
      "ko": "컨트롤",
      "pt": "Controles",
      "ru": "Управление",
      "tr": "Kontroller",
      "uk": "Керування"
    },
    "controls_body": {
      "en": "The control area provides the following buttons and links:",
      "cn": "控制区域提供以下按钮和链接：",
      "de": "Der Steuerungsbereich bietet folgende Tasten und Links:",
      "es": "El área de control proporciona los siguientes botones y enlaces:",
      "fr": "La zone de contrôle fournit les boutons et liens suivants :",
      "it": "L'area di controllo fornisce i seguenti pulsanti e link:",
      "ja": "コントロールエリアには以下のボタンとリンクがあります：",
      "ko": "컨트롤 영역에는 다음 버튼과 링크가 있습니다:",
      "pt": "A área de controle fornece os seguintes botões e links:",
      "ru": "Область управления содержит следующие кнопки и ссылки:",
      "tr": "Kontrol alanı şu düğmeleri ve bağlantıları sağlar:",
      "uk": "Область керування містить такі кнопки та посилання:"
    },
    "channels_title": {
      "en": "Channel Input",
      "cn": "通道输入",
      "de": "Kanaleingabe",
      "es": "Entrada de canal",
      "fr": "Saisie des canaux",
      "it": "Input canali",
      "ja": "チャンネル入力",
      "ko": "채널 입력",
      "pt": "Entrada de canal",
      "ru": "Ввод каналов",
      "tr": "Kanal Girişi",
      "uk": "Введення каналів"
    },
    "channels_body": {
      "en": "Enter MML notation into the CH1–CH4 text fields. For example, entering {0} plays the notes Do-Re-Mi. Both uppercase and lowercase letters are accepted. Each channel has SOLO and MUTE buttons:",
      "cn": "在 CH1–CH4 文本框中输入 MML 记法。例如，输入 {0} 将播放 Do-Re-Mi 音符。大小写均可。每个通道有 SOLO 和 MUTE 按钮：",
      "de": "Geben Sie MML-Notation in die Textfelder CH1–CH4 ein. Zum Beispiel spielt die Eingabe von {0} die Noten Do-Re-Mi. Groß- und Kleinschreibung werden akzeptiert. Jeder Kanal hat SOLO- und MUTE-Tasten:",
      "es": "Ingresa notación MML en los campos de texto CH1–CH4. Por ejemplo, ingresar {0} reproduce las notas Do-Re-Mi. Se aceptan mayúsculas y minúsculas. Cada canal tiene botones SOLO y MUTE:",
      "fr": "Entrez la notation MML dans les champs texte CH1–CH4. Par exemple, saisir {0} joue les notes Do-Ré-Mi. Les majuscules et minuscules sont acceptées. Chaque canal a des boutons SOLO et MUTE :",
      "it": "Inserisci la notazione MML nei campi di testo CH1–CH4. Ad esempio, inserendo {0} si riproducono le note Do-Re-Mi. Sono accettate sia maiuscole che minuscole. Ogni canale ha pulsanti SOLO e MUTE:",
      "ja": "CH1〜CH4のテキスト欄にMML記法を入力します。例えば{0}と入力するとド・レ・ミが再生されます。大文字・小文字のどちらでも入力可能です。各チャンネルにはSOLOとMUTEボタンがあります：",
      "ko": "CH1–CH4 텍스트 필드에 MML 기보법을 입력합니다. 예를 들어 {0}을 입력하면 도-레-미가 재생됩니다. 대소문자 모두 사용 가능합니다. 각 채널에는 SOLO와 MUTE 버튼이 있습니다:",
      "pt": "Insira notação MML nos campos de texto CH1–CH4. Por exemplo, inserir {0} reproduz as notas Dó-Ré-Mi. Letras maiúsculas e minúsculas são aceitas. Cada canal tem botões SOLO e MUTE:",
      "ru": "Вводите MML-нотацию в текстовые поля CH1–CH4. Например, ввод {0} воспроизводит ноты До-Ре-Ми. Принимаются как заглавные, так и строчные буквы. Каждый канал имеет кнопки SOLO и MUTE:",
      "tr": "CH1–CH4 metin alanlarına MML notasyonu girin. Örneğin {0} girişi Do-Re-Mi notalarını çalar. Büyük ve küçük harfler kabul edilir. Her kanalda SOLO ve MUTE düğmeleri vardır:",
      "uk": "Введіть MML-нотацію в текстові поля CH1–CH4. Наприклад, введення {0} відтворює ноти До-Ре-Мі. Приймаються як великі, так і малі літери. Кожен канал має кнопки SOLO та MUTE:"
    },
    "sharing_title": {
      "en": "Sharing via URL and QR Code",
      "cn": "通过 URL 和二维码分享",
      "de": "Teilen über URL und QR-Code",
      "es": "Compartir mediante URL y código QR",
      "fr": "Partage par URL et QR code",
      "it": "Condivisione tramite URL e codice QR",
      "ja": "URLとQRコードによる共有",
      "ko": "URL 및 QR 코드를 통한 공유",
      "pt": "Compartilhamento via URL e código QR",
      "ru": "Публикация через URL и QR-код",
      "tr": "URL ve QR Kodu ile Paylaşım",
      "uk": "Поширення через URL та QR-код"
    },
    "sharing_body": {
      "en": "Pyxel MML Studio does not have save or load functionality. Instead, all MML data is compressed and embedded directly in the URL as a query parameter. Share the URL to publish your work. A QR code corresponding to the URL is also generated automatically.",
      "cn": "Pyxel MML Studio 没有保存和加载功能。所有 MML 数据会被压缩后直接嵌入 URL 的查询参数中。分享 URL 即可发布作品。对应的二维码也会自动生成。",
      "de": "Pyxel MML Studio hat keine Speicher- oder Ladefunktion. Stattdessen werden alle MML-Daten komprimiert und direkt als Abfrageparameter in die URL eingebettet. Teilen Sie die URL, um Ihr Werk zu veröffentlichen. Ein QR-Code für die URL wird ebenfalls automatisch generiert.",
      "es": "Pyxel MML Studio no tiene función de guardar ni cargar. En su lugar, todos los datos MML se comprimen e integran directamente en la URL como parámetro de consulta. Comparte la URL para publicar tu obra. También se genera automáticamente un código QR correspondiente a la URL.",
      "fr": "Pyxel MML Studio n'a pas de fonction de sauvegarde ni de chargement. À la place, toutes les données MML sont compressées et intégrées directement dans l'URL comme paramètre de requête. Partagez l'URL pour publier votre œuvre. Un QR code correspondant à l'URL est également généré automatiquement.",
      "it": "Pyxel MML Studio non ha funzionalità di salvataggio o caricamento. Tutti i dati MML vengono compressi e incorporati direttamente nell'URL come parametro di query. Condividi l'URL per pubblicare la tua opera. Viene generato automaticamente anche un codice QR corrispondente all'URL.",
      "ja": "Pyxel MML Studioにはセーブ・ロード機能がありません。代わりに、すべてのMMLデータは圧縮されてURLのクエリパラメータに直接埋め込まれます。URLを共有するだけで作品を公開できます。URLに対応するQRコードも自動的に生成されます。",
      "ko": "Pyxel MML Studio에는 저장 및 불러오기 기능이 없습니다. 대신 모든 MML 데이터가 압축되어 URL의 쿼리 파라미터로 직접 포함됩니다. URL을 공유하여 작품을 공개할 수 있습니다. URL에 해당하는 QR 코드도 자동으로 생성됩니다.",
      "pt": "O Pyxel MML Studio não possui funcionalidade de salvar ou carregar. Em vez disso, todos os dados MML são comprimidos e incorporados diretamente na URL como parâmetro de consulta. Compartilhe a URL para publicar seu trabalho. Um código QR correspondente à URL também é gerado automaticamente.",
      "ru": "В Pyxel MML Studio нет функций сохранения и загрузки. Вместо этого все данные MML сжимаются и встраиваются непосредственно в URL в качестве параметра запроса. Поделитесь URL для публикации работы. QR-код, соответствующий URL, также генерируется автоматически.",
      "tr": "Pyxel MML Studio'da kaydetme veya yükleme işlevi yoktur. Bunun yerine tüm MML verileri sıkıştırılarak doğrudan URL'ye sorgu parametresi olarak gömülür. Eserinizi yayınlamak için URL'yi paylaşın. URL'ye karşılık gelen QR kodu da otomatik olarak oluşturulur.",
      "uk": "Pyxel MML Studio не має функцій збереження та завантаження. Натомість усі дані MML стискаються та вбудовуються безпосередньо в URL як параметр запиту. Поділіться URL для публікації роботи. QR-код, що відповідає URL, також генерується автоматично."
    },
    "shortcuts_title": {
      "en": "Keyboard Shortcuts",
      "cn": "键盘快捷键",
      "de": "Tastenkombinationen",
      "es": "Atajos de teclado",
      "fr": "Raccourcis clavier",
      "it": "Scorciatoie da tastiera",
      "ja": "キーボードショートカット",
      "ko": "키보드 단축키",
      "pt": "Atalhos de teclado",
      "ru": "Горячие клавиши",
      "tr": "Klavye Kısayolları",
      "uk": "Гарячі клавіші"
    },
    "shortcuts_body": {
      "en": "The following keyboard shortcuts are available. On macOS, use Cmd instead of Ctrl.",
      "cn": "可以使用以下键盘快捷键。在 macOS 上，使用 Cmd 代替 Ctrl。",
      "de": "Die folgenden Tastenkombinationen sind verfügbar. Unter macOS verwenden Sie Cmd statt Ctrl.",
      "es": "Los siguientes atajos de teclado están disponibles. En macOS, use Cmd en lugar de Ctrl.",
      "fr": "Les raccourcis clavier suivants sont disponibles. Sur macOS, utilisez Cmd au lieu de Ctrl.",
      "it": "Sono disponibili le seguenti scorciatoie da tastiera. Su macOS, usare Cmd al posto di Ctrl.",
      "ja": "以下のキーボードショートカットが使用できます。macOSではCtrlの代わりにCmdを使用します。",
      "ko": "다음 키보드 단축키를 사용할 수 있습니다. macOS에서는 Ctrl 대신 Cmd를 사용합니다.",
      "pt": "Os seguintes atalhos de teclado estão disponíveis. No macOS, use Cmd em vez de Ctrl.",
      "ru": "Доступны следующие горячие клавиши. На macOS используйте Cmd вместо Ctrl.",
      "tr": "Aşağıdaki klavye kısayolları kullanılabilir. macOS'ta Ctrl yerine Cmd kullanın.",
      "uk": "Доступні такі гарячі клавіші. На macOS використовуйте Cmd замість Ctrl."
    },
    "th_shortcut": {
      "en": "Shortcut",
      "cn": "快捷键",
      "de": "Tastenkombination",
      "es": "Atajo",
      "fr": "Raccourci",
      "it": "Scorciatoia",
      "ja": "ショートカット",
      "ko": "단축키",
      "pt": "Atalho",
      "ru": "Сочетание клавиш",
      "tr": "Kısayol",
      "uk": "Клавіші"
    },
    "th_action": {
      "en": "Action",
      "cn": "操作",
      "de": "Aktion",
      "es": "Acción",
      "fr": "Action",
      "it": "Azione",
      "ja": "動作",
      "ko": "동작",
      "pt": "Ação",
      "ru": "Действие",
      "tr": "İşlem",
      "uk": "Дія"
    },
    "mml_ref_title": {
      "en": "MML Command Reference",
      "cn": "MML 命令参考",
      "de": "MML-Befehlsreferenz",
      "es": "Referencia de comandos MML",
      "fr": "Référence des commandes MML",
      "it": "Riferimento comandi MML",
      "ja": "MMLコマンドリファレンス",
      "ko": "MML 명령어 참조",
      "pt": "Referência de comandos MML",
      "ru": "Справочник MML-команд",
      "tr": "MML Komut Referansı",
      "uk": "Довідник MML-команд"
    },
    "mml_ref_body": {
      "en": "For the complete list of MML commands supported by Pyxel, see {0}.",
      "cn": "有关 Pyxel 支持的完整 MML 命令列表，请参阅{0}。",
      "de": "Die vollständige Liste der von Pyxel unterstützten MML-Befehle finden Sie unter {0}.",
      "es": "Para la lista completa de comandos MML soportados por Pyxel, consulte {0}.",
      "fr": "Pour la liste complète des commandes MML prises en charge par Pyxel, consultez {0}.",
      "it": "Per l'elenco completo dei comandi MML supportati da Pyxel, consultare {0}.",
      "ja": "Pyxelがサポートする全MMLコマンドについては{0}をご覧ください。",
      "ko": "Pyxel이 지원하는 전체 MML 명령어 목록은 {0}을 참조하세요.",
      "pt": "Para a lista completa de comandos MML suportados pelo Pyxel, consulte {0}.",
      "ru": "Полный список MML-команд, поддерживаемых Pyxel, см. в {0}.",
      "tr": "Pyxel tarafından desteklenen MML komutlarının tam listesi için {0} sayfasına bakın.",
      "uk": "Повний список MML-команд, підтримуваних Pyxel, див. у {0}."
    },
    "mml_ref_link": {
      "en": "Pyxel MML Commands",
      "ja": "Pyxel MML Commands"
    }
  },
  "control_items": [
    {
      "label": "PLAY",
      "desc": {
        "en": "Start playback of the MML entered in all channels.",
        "cn": "开始播放所有通道中输入的 MML。",
        "de": "Wiedergabe der in allen Kanälen eingegebenen MML starten.",
        "es": "Iniciar la reproducción del MML ingresado en todos los canales.",
        "fr": "Démarrer la lecture du MML saisi dans tous les canaux.",
        "it": "Avvia la riproduzione dell'MML inserito in tutti i canali.",
        "ja": "全チャンネルに入力されたMMLの再生を開始します。",
        "ko": "모든 채널에 입력된 MML 재생을 시작합니다.",
        "pt": "Iniciar a reprodução do MML inserido em todos os canais.",
        "ru": "Начать воспроизведение MML, введённого во всех каналах.",
        "tr": "Tüm kanallara girilen MML'nin oynatılmasını başlatın.",
        "uk": "Розпочати відтворення MML, введеного в усіх каналах."
      }
    },
    {
      "label": "STOP",
      "desc": {
        "en": "Stop playback.",
        "cn": "停止播放。",
        "de": "Wiedergabe stoppen.",
        "es": "Detener la reproducción.",
        "fr": "Arrêter la lecture.",
        "it": "Ferma la riproduzione.",
        "ja": "再生を停止します。",
        "ko": "재생을 중지합니다.",
        "pt": "Parar a reprodução.",
        "ru": "Остановить воспроизведение.",
        "tr": "Oynatmayı durdurun.",
        "uk": "Зупинити відтворення."
      }
    },
    {
      "label": "LOOP",
      "desc": {
        "en": "Toggle loop playback on or off. Enabled by default.",
        "cn": "切换循环播放的开关。默认开启。",
        "de": "Schleifenwiedergabe ein- oder ausschalten. Standardmäßig aktiviert.",
        "es": "Activar o desactivar la reproducción en bucle. Activado por defecto.",
        "fr": "Activer ou désactiver la lecture en boucle. Activé par défaut.",
        "it": "Attiva o disattiva la riproduzione in loop. Abilitato per impostazione predefinita.",
        "ja": "ループ再生のオン・オフを切り替えます。デフォルトはオンです。",
        "ko": "반복 재생을 켜거나 끕니다. 기본적으로 활성화되어 있습니다.",
        "pt": "Ativar ou desativar a reprodução em loop. Ativado por padrão.",
        "ru": "Включить или выключить циклическое воспроизведение. По умолчанию включено.",
        "tr": "Döngü oynatmayı açın veya kapatın. Varsayılan olarak etkindir.",
        "uk": "Увімкнути або вимкнути циклічне відтворення. За замовчуванням увімкнено."
      }
    },
    {
      "label": "Pyxel MML Commands",
      "type": "link",
      "desc": {
        "en": "Open the MML command reference page.",
        "cn": "打开 MML 命令参考页面。",
        "de": "Die MML-Befehlsreferenzseite öffnen.",
        "es": "Abrir la página de referencia de comandos MML.",
        "fr": "Ouvrir la page de référence des commandes MML.",
        "it": "Aprire la pagina di riferimento dei comandi MML.",
        "ja": "MMLコマンドリファレンスページを開きます。",
        "ko": "MML 명령어 참조 페이지를 엽니다.",
        "pt": "Abrir a página de referência de comandos MML.",
        "ru": "Открыть страницу справочника MML-команд.",
        "tr": "MML komut referansı sayfasını açın.",
        "uk": "Відкрити сторінку довідника MML-команд."
      }
    },
    {
      "label": "Sample Tune",
      "type": "link",
      "desc": {
        "en": "Load a sample tune to hear what Pyxel MML can produce.",
        "cn": "加载示例曲目，试听 Pyxel MML 的效果。",
        "de": "Ein Beispielstück laden, um zu hören, was Pyxel MML kann.",
        "es": "Cargar una melodía de ejemplo para escuchar lo que Pyxel MML puede producir.",
        "fr": "Charger un morceau d'exemple pour entendre ce que Pyxel MML peut produire.",
        "it": "Carica un brano di esempio per ascoltare cosa può produrre Pyxel MML.",
        "ja": "Pyxel MMLの作例を読み込んで聴くことができます。",
        "ko": "Pyxel MML의 작례를 불러와 들어볼 수 있습니다.",
        "pt": "Carregar uma melodia de exemplo para ouvir o que o Pyxel MML pode produzir.",
        "ru": "Загрузить пример мелодии, чтобы послушать возможности Pyxel MML.",
        "tr": "Pyxel MML'nin neler üretebileceğini duymak için örnek bir melodi yükleyin.",
        "uk": "Завантажити зразок мелодії, щоб почути можливості Pyxel MML."
      }
    }
  ],
  "channel_items": [
    {
      "label": "SOLO",
      "desc": {
        "en": "Play only this channel, muting all others.",
        "cn": "仅播放此通道，将其他通道静音。",
        "de": "Nur diesen Kanal abspielen, alle anderen stummschalten.",
        "es": "Reproducir solo este canal, silenciando todos los demás.",
        "fr": "Jouer uniquement ce canal, en coupant tous les autres.",
        "it": "Riprodurre solo questo canale, silenziando tutti gli altri.",
        "ja": "他のチャンネルをミュートし、このチャンネルのみを再生します。",
        "ko": "다른 채널을 음소거하고 이 채널만 재생합니다.",
        "pt": "Reproduzir apenas este canal, silenciando todos os outros.",
        "ru": "Воспроизводить только этот канал, заглушая все остальные.",
        "tr": "Diğerlerini sessize alarak yalnızca bu kanalı çalın.",
        "uk": "Відтворювати лише цей канал, вимкнувши всі інші."
      }
    },
    {
      "label": "MUTE",
      "desc": {
        "en": "Mute this channel during playback.",
        "cn": "在播放时将此通道静音。",
        "de": "Diesen Kanal während der Wiedergabe stummschalten.",
        "es": "Silenciar este canal durante la reproducción.",
        "fr": "Couper le son de ce canal pendant la lecture.",
        "it": "Silenziare questo canale durante la riproduzione.",
        "ja": "再生中にこのチャンネルをミュートします。",
        "ko": "재생 중 이 채널을 음소거합니다.",
        "pt": "Silenciar este canal durante a reprodução.",
        "ru": "Заглушить этот канал при воспроизведении.",
        "tr": "Oynatma sırasında bu kanalı sessize alın.",
        "uk": "Вимкнути цей канал під час відтворення."
      }
    }
  ],
  "shortcuts": [
    {
      "key": "Ctrl(Cmd)+Enter",
      "action": {
        "en": "Start playback",
        "cn": "开始播放",
        "de": "Wiedergabe starten",
        "es": "Iniciar reproducción",
        "fr": "Démarrer la lecture",
        "it": "Avvia riproduzione",
        "ja": "再生を開始する",
        "ko": "재생 시작",
        "pt": "Iniciar reprodução",
        "ru": "Начать воспроизведение",
        "tr": "Oynatmayı başlat",
        "uk": "Розпочати відтворення"
      }
    },
    {
      "key": "Esc",
      "action": {
        "en": "Stop playback",
        "cn": "停止播放",
        "de": "Wiedergabe stoppen",
        "es": "Detener reproducción",
        "fr": "Arrêter la lecture",
        "it": "Ferma riproduzione",
        "ja": "再生を停止する",
        "ko": "재생 중지",
        "pt": "Parar reprodução",
        "ru": "Остановить воспроизведение",
        "tr": "Oynatmayı durdur",
        "uk": "Зупинити відтворення"
      }
    },
    {
      "key": "Ctrl(Cmd)+L",
      "action": {
        "en": "Toggle loop playback",
        "cn": "切换循环播放",
        "de": "Schleifenwiedergabe umschalten",
        "es": "Alternar reproducción en bucle",
        "fr": "Basculer la lecture en boucle",
        "it": "Commuta riproduzione in loop",
        "ja": "ループ再生を切り替える",
        "ko": "반복 재생 전환",
        "pt": "Alternar reprodução em loop",
        "ru": "Переключить циклическое воспроизведение",
        "tr": "Döngü oynatmayı değiştir",
        "uk": "Перемкнути циклічне відтворення"
      }
    }
  ]
}
