{
  "languages": [
    { "code": "en", "name": "English" },
    { "code": "cn", "name": "中文" },
    { "code": "de", "name": "Deutsch" },
    { "code": "es", "name": "Español" },
    { "code": "fr", "name": "Français" },
    { "code": "it", "name": "Italiano" },
    { "code": "ja", "name": "日本語" },
    { "code": "ko", "name": "한국어" },
    { "code": "pt", "name": "Português" },
    { "code": "ru", "name": "Русский" },
    { "code": "tr", "name": "Türkçe" },
    { "code": "uk", "name": "Українська" }
  ],
  "ui": {
    "title": {
      "en": "Pyxel Code Maker Manual",
      "cn": "Pyxel Code Maker 手册",
      "de": "Pyxel Code Maker Handbuch",
      "es": "Manual de Pyxel Code Maker",
      "fr": "Manuel de Pyxel Code Maker",
      "it": "Manuale di Pyxel Code Maker",
      "ja": "Pyxel Code Maker マニュアル",
      "ko": "Pyxel Code Maker 매뉴얼",
      "pt": "Manual do Pyxel Code Maker",
      "ru": "Руководство Pyxel Code Maker",
      "tr": "Pyxel Code Maker Kılavuzu",
      "uk": "Посібник Pyxel Code Maker"
    },
    "subtitle": {
      "en": "Manual for the {0} online development environment.",
      "cn": "{0} 在线开发环境手册",
      "de": "Handbuch für die {0}-Online-Entwicklungsumgebung.",
      "es": "Manual del entorno de desarrollo en línea de {0}.",
      "fr": "Manuel de l'environnement de développement en ligne {0}.",
      "it": "Manuale dell'ambiente di sviluppo online di {0}.",
      "ja": "{0} のオンライン開発環境マニュアル",
      "ko": "{0} 온라인 개발 환경 매뉴얼",
      "pt": "Manual do ambiente de desenvolvimento online do {0}.",
      "ru": "Руководство по онлайн-среде разработки {0}.",
      "tr": "{0} çevrimiçi geliştirme ortamı kılavuzu.",
      "uk": "Посібник онлайн-середовища розробки {0}."
    },
    "overview_title": {
      "en": "Overview",
      "cn": "概述",
      "de": "Überblick",
      "es": "Descripción general",
      "fr": "Présentation",
      "it": "Panoramica",
      "ja": "概要",
      "ko": "개요",
      "pt": "Visão geral",
      "ru": "Обзор",
      "tr": "Genel Bakış",
      "uk": "Огляд"
    },
    "overview_body": {
      "en": "Pyxel Code Maker is a browser-based online development environment for Pyxel. It allows you to write Python code, create game resources (images, tilemaps, sounds, music), and run your application — all in the browser without any installation.",
      "cn": "Pyxel Code Maker 是基于浏览器的 Pyxel 在线开发环境。无需安装，即可在浏览器中编写 Python 代码、创建游戏资源（图像、地图、声音、音乐）并运行应用程序。",
      "de": "Pyxel Code Maker ist eine browserbasierte Online-Entwicklungsumgebung für Pyxel. Sie können Python-Code schreiben, Spielressourcen (Bilder, Tilemaps, Sounds, Musik) erstellen und Ihre Anwendung ausführen — alles im Browser ohne Installation.",
      "es": "Pyxel Code Maker es un entorno de desarrollo en línea basado en navegador para Pyxel. Permite escribir código Python, crear recursos de juego (imágenes, tilemaps, sonidos, música) y ejecutar tu aplicación, todo en el navegador sin instalación.",
      "fr": "Pyxel Code Maker est un environnement de développement en ligne basé sur le navigateur pour Pyxel. Il vous permet d'écrire du code Python, de créer des ressources de jeu (images, tilemaps, sons, musique) et d'exécuter votre application, le tout dans le navigateur sans installation.",
      "it": "Pyxel Code Maker è un ambiente di sviluppo online basato sul browser per Pyxel. Consente di scrivere codice Python, creare risorse di gioco (immagini, tilemap, suoni, musica) ed eseguire l'applicazione, tutto nel browser senza installazione.",
      "ja": "Pyxel Code Makerは、Pyxelのブラウザベースオンライン開発環境です。Pythonコードの記述、ゲームリソース（画像・タイルマップ・サウンド・ミュージック）の作成、アプリケーションの実行を、インストール不要でブラウザ上で行えます。",
      "ko": "Pyxel Code Maker는 Pyxel용 브라우저 기반 온라인 개발 환경입니다. 설치 없이 브라우저에서 Python 코드 작성, 게임 리소스(이미지, 타일맵, 사운드, 음악) 생성, 애플리케이션 실행이 가능합니다.",
      "pt": "O Pyxel Code Maker é um ambiente de desenvolvimento online baseado em navegador para o Pyxel. Permite escrever código Python, criar recursos de jogo (imagens, tilemaps, sons, música) e executar sua aplicação — tudo no navegador sem instalação.",
      "ru": "Pyxel Code Maker — это браузерная онлайн-среда разработки для Pyxel. Она позволяет писать код на Python, создавать игровые ресурсы (изображения, тайлмапы, звуки, музыку) и запускать приложение — всё в браузере без установки.",
      "tr": "Pyxel Code Maker, Pyxel için tarayıcı tabanlı bir çevrimiçi geliştirme ortamıdır. Kurulum gerektirmeden tarayıcıda Python kodu yazmanıza, oyun kaynakları (görüntüler, tilemap'ler, sesler, müzik) oluşturmanıza ve uygulamanızı çalıştırmanıza olanak tanır.",
      "uk": "Pyxel Code Maker — це браузерне онлайн-середовище розробки для Pyxel. Воно дозволяє писати код на Python, створювати ігрові ресурси (зображення, тайлмапи, звуки, музику) та запускати застосунок — усе в браузері без встановлення."
    },
    "layout_title": {
      "en": "Screen Layout",
      "cn": "屏幕布局",
      "de": "Bildschirmlayout",
      "es": "Diseño de pantalla",
      "fr": "Disposition de l'écran",
      "it": "Layout dello schermo",
      "ja": "画面構成",
      "ko": "화면 구성",
      "pt": "Layout da tela",
      "ru": "Макет экрана",
      "tr": "Ekran Düzeni",
      "uk": "Макет екрана"
    },
    "layout_body": {
      "en": "The screen consists of the toolbar at the top, the editing area on the left, and the runtime screen on the right.",
      "cn": "屏幕由顶部的工具栏、左侧的编辑区域和右侧的运行画面组成。",
      "de": "Der Bildschirm besteht aus der Symbolleiste oben, dem Bearbeitungsbereich links und dem Ausführungsbildschirm rechts.",
      "es": "La pantalla consta de la barra de herramientas en la parte superior, el área de edición a la izquierda y la pantalla de ejecución a la derecha.",
      "fr": "L'écran se compose de la barre d'outils en haut, de la zone d'édition à gauche et de l'écran d'exécution à droite.",
      "it": "Lo schermo è composto dalla barra degli strumenti in alto, dall'area di modifica a sinistra e dallo schermo di esecuzione a destra.",
      "ja": "画面は上部のツールバー、左側の編集エリア、右側の実行画面で構成されています。",
      "ko": "화면은 상단의 툴바, 왼쪽의 편집 영역, 오른쪽의 실행 화면으로 구성됩니다.",
      "pt": "A tela consiste na barra de ferramentas no topo, na área de edição à esquerda e na tela de execução à direita.",
      "ru": "Экран состоит из панели инструментов вверху, области редактирования слева и экрана выполнения справа.",
      "tr": "Ekran, üstteki araç çubuğu, soldaki düzenleme alanı ve sağdaki çalışma ekranından oluşur.",
      "uk": "Екран складається з панелі інструментів зверху, області редагування зліва та екрана виконання справа."
    },
    "layout_toolbar": {
      "en": "Toolbar",
      "cn": "工具栏",
      "de": "Symbolleiste",
      "es": "Barra de herramientas",
      "fr": "Barre d'outils",
      "it": "Barra degli strumenti",
      "ja": "ツールバー",
      "ko": "툴바",
      "pt": "Barra de ferramentas",
      "ru": "Панель инструментов",
      "tr": "Araç Çubuğu",
      "uk": "Панель інструментів"
    },
    "layout_toolbar_desc": {
      "en": "Contains buttons for project management and application control.",
      "cn": "包含项目管理和应用程序控制的按钮。",
      "de": "Enthält Schaltflächen für Projektverwaltung und Anwendungssteuerung.",
      "es": "Contiene botones para la gestión de proyectos y el control de la aplicación.",
      "fr": "Contient des boutons pour la gestion de projet et le contrôle de l'application.",
      "it": "Contiene pulsanti per la gestione del progetto e il controllo dell'applicazione.",
      "ja": "プロジェクト管理とアプリケーション制御のボタンを含みます。",
      "ko": "프로젝트 관리 및 애플리케이션 제어 버튼을 포함합니다.",
      "pt": "Contém botões para gerenciamento de projetos e controle de aplicação.",
      "ru": "Содержит кнопки для управления проектом и приложением.",
      "tr": "Proje yönetimi ve uygulama kontrolü için düğmeler içerir.",
      "uk": "Містить кнопки для керування проєктом та застосунком."
    },
    "layout_focus_line": {
      "en": "Focus Line",
      "cn": "焦点线",
      "de": "Fokuszeile",
      "es": "Línea de enfoque",
      "fr": "Ligne de focus",
      "it": "Linea di focus",
      "ja": "フォーカスライン",
      "ko": "포커스 라인",
      "pt": "Linha de foco",
      "ru": "Линия фокуса",
      "tr": "Odak Çizgisi",
      "uk": "Лінія фокусу"
    },
    "layout_focus_line_desc": {
      "en": "A thin line below the toolbar indicating which pane is currently focused. The active segment turns cyan.",
      "cn": "工具栏下方的细线，指示当前聚焦的面板。活动部分变为青色。",
      "de": "Eine dünne Linie unter der Symbolleiste, die anzeigt, welcher Bereich aktuell fokussiert ist. Das aktive Segment wird cyan.",
      "es": "Una línea delgada debajo de la barra de herramientas que indica qué panel tiene el enfoque. El segmento activo se vuelve cian.",
      "fr": "Une fine ligne sous la barre d'outils indiquant quel panneau est actuellement actif. Le segment actif devient cyan.",
      "it": "Una linea sottile sotto la barra degli strumenti che indica quale pannello è attualmente attivo. Il segmento attivo diventa ciano.",
      "ja": "ツールバー下部の細い線で、現在フォーカスされているペインを示します。アクティブな部分がシアンに変わります。",
      "ko": "현재 포커스된 패널을 나타내는 툴바 아래의 가는 선입니다. 활성 부분이 시안색으로 변합니다.",
      "pt": "Uma linha fina abaixo da barra de ferramentas indicando qual painel está em foco. O segmento ativo fica ciano.",
      "ru": "Тонкая линия под панелью инструментов, показывающая, какая панель сейчас в фокусе. Активный сегмент становится голубым.",
      "tr": "Araç çubuğunun altında hangi panelin odaklandığını gösteren ince çizgi. Aktif bölüm camgöbeği rengine döner.",
      "uk": "Тонка лінія під панеллю інструментів, що показує, яка панель зараз у фокусі. Активний сегмент стає блакитним."
    },
    "layout_editing_area": {
      "en": "Editing Area",
      "cn": "编辑区域",
      "de": "Bearbeitungsbereich",
      "es": "Área de edición",
      "fr": "Zone d'édition",
      "it": "Area di modifica",
      "ja": "編集エリア",
      "ko": "편집 영역",
      "pt": "Área de edição",
      "ru": "Область редактирования",
      "tr": "Düzenleme Alanı",
      "uk": "Область редагування"
    },
    "layout_editing_area_desc": {
      "en": "Switches between the code editor and resource editor via the Code/Res toggle.",
      "cn": "通过 Code/Res 切换按钮在代码编辑器和资源编辑器之间切换。",
      "de": "Wechselt zwischen Code-Editor und Ressourcen-Editor über den Code/Res-Umschalter.",
      "es": "Alterna entre el editor de código y el editor de recursos mediante el selector Code/Res.",
      "fr": "Bascule entre l'éditeur de code et l'éditeur de ressources via le bouton Code/Res.",
      "it": "Passa dall'editor di codice all'editor di risorse tramite il pulsante Code/Res.",
      "ja": "Code/Resトグルでコードエディタとリソースエディタを切り替えます。",
      "ko": "Code/Res 토글로 코드 에디터와 리소스 에디터를 전환합니다.",
      "pt": "Alterna entre o editor de código e o editor de recursos pelo botão Code/Res.",
      "ru": "Переключается между редактором кода и редактором ресурсов с помощью переключателя Code/Res.",
      "tr": "Code/Res düğmesiyle kod düzenleyici ve kaynak düzenleyici arasında geçiş yapar.",
      "uk": "Перемикається між редактором коду та редактором ресурсів за допомогою перемикача Code/Res."
    },
    "layout_splitter": {
      "en": "Splitter",
      "cn": "分隔条",
      "de": "Trennleiste",
      "es": "Divisor",
      "fr": "Séparateur",
      "it": "Divisore",
      "ja": "スプリッター",
      "ko": "스플리터",
      "pt": "Divisor",
      "ru": "Разделитель",
      "tr": "Ayırıcı",
      "uk": "Роздільник"
    },
    "layout_splitter_desc": {
      "en": "The boundary between the editing area and runtime screen. Drag to adjust the proportions.",
      "cn": "编辑区域和运行画面之间的边界。拖动以调整比例。",
      "de": "Die Grenze zwischen Bearbeitungsbereich und Ausführungsbildschirm. Ziehen, um die Proportionen anzupassen.",
      "es": "El límite entre el área de edición y la pantalla de ejecución. Arrastre para ajustar las proporciones.",
      "fr": "La frontière entre la zone d'édition et l'écran d'exécution. Faites glisser pour ajuster les proportions.",
      "it": "Il confine tra l'area di modifica e lo schermo di esecuzione. Trascinare per regolare le proporzioni.",
      "ja": "編集エリアと実行画面の境界です。ドラッグして比率を調整できます。",
      "ko": "편집 영역과 실행 화면 사이의 경계입니다. 드래그하여 비율을 조정합니다.",
      "pt": "O limite entre a área de edição e a tela de execução. Arraste para ajustar as proporções.",
      "ru": "Граница между областью редактирования и экраном выполнения. Перетаскивайте для настройки пропорций.",
      "tr": "Düzenleme alanı ile çalışma ekranı arasındaki sınır. Oranları ayarlamak için sürükleyin.",
      "uk": "Межа між областю редагування та екраном виконання. Перетягніть для налаштування пропорцій."
    },
    "layout_runtime": {
      "en": "Runtime Screen",
      "cn": "运行画面",
      "de": "Ausführungsbildschirm",
      "es": "Pantalla de ejecución",
      "fr": "Écran d'exécution",
      "it": "Schermo di esecuzione",
      "ja": "実行画面",
      "ko": "실행 화면",
      "pt": "Tela de execução",
      "ru": "Экран выполнения",
      "tr": "Çalışma Ekranı",
      "uk": "Екран виконання"
    },
    "layout_runtime_desc": {
      "en": "Displays the running application.",
      "cn": "显示正在运行的应用程序。",
      "de": "Zeigt die laufende Anwendung an.",
      "es": "Muestra la aplicación en ejecución.",
      "fr": "Affiche l'application en cours d'exécution.",
      "it": "Visualizza l'applicazione in esecuzione.",
      "ja": "実行中のアプリケーションを表示します。",
      "ko": "실행 중인 애플리케이션을 표시합니다.",
      "pt": "Exibe a aplicação em execução.",
      "ru": "Отображает запущенное приложение.",
      "tr": "Çalışan uygulamayı görüntüler.",
      "uk": "Відображає запущений застосунок."
    },
    "toolbar_title": {
      "en": "Toolbar",
      "cn": "工具栏",
      "de": "Symbolleiste",
      "es": "Barra de herramientas",
      "fr": "Barre d'outils",
      "it": "Barra degli strumenti",
      "ja": "ツールバー",
      "ko": "툴바",
      "pt": "Barra de ferramentas",
      "ru": "Панель инструментов",
      "tr": "Araç Çubuğu",
      "uk": "Панель інструментів"
    },
    "toolbar_body": {
      "en": "The toolbar provides the following buttons:",
      "cn": "工具栏提供以下按钮：",
      "de": "Die Symbolleiste bietet folgende Schaltflächen:",
      "es": "La barra de herramientas proporciona los siguientes botones:",
      "fr": "La barre d'outils fournit les boutons suivants :",
      "it": "La barra degli strumenti fornisce i seguenti pulsanti:",
      "ja": "ツールバーには以下のボタンがあります：",
      "ko": "툴바에는 다음 버튼이 있습니다:",
      "pt": "A barra de ferramentas fornece os seguintes botões:",
      "ru": "Панель инструментов содержит следующие кнопки:",
      "tr": "Araç çubuğu şu düğmeleri sağlar:",
      "uk": "Панель інструментів містить такі кнопки:"
    },
    "code_title": {
      "en": "Code Editor",
      "cn": "代码编辑器",
      "de": "Code-Editor",
      "es": "Editor de código",
      "fr": "Éditeur de code",
      "it": "Editor di codice",
      "ja": "コードエディタ",
      "ko": "코드 에디터",
      "pt": "Editor de código",
      "ru": "Редактор кода",
      "tr": "Kod Düzenleyici",
      "uk": "Редактор коду"
    },
    "code_body": {
      "en": "The code editor provides Python syntax highlighting and auto-completion. Write your Pyxel application code here. The default entry point is {0}.",
      "cn": "代码编辑器提供 Python 语法高亮和自动补全。在这里编写 Pyxel 应用程序代码。默认入口点是 {0}。",
      "de": "Der Code-Editor bietet Python-Syntaxhervorhebung und Autovervollständigung. Schreiben Sie hier Ihren Pyxel-Anwendungscode. Der Standard-Einstiegspunkt ist {0}.",
      "es": "El editor de código proporciona resaltado de sintaxis Python y autocompletado. Escriba el código de su aplicación Pyxel aquí. El punto de entrada predeterminado es {0}.",
      "fr": "L'éditeur de code offre la coloration syntaxique Python et l'autocomplétion. Écrivez le code de votre application Pyxel ici. Le point d'entrée par défaut est {0}.",
      "it": "L'editor di codice offre evidenziazione della sintassi Python e completamento automatico. Scrivi il codice della tua applicazione Pyxel qui. Il punto di ingresso predefinito è {0}.",
      "ja": "コードエディタはPython構文ハイライトとオートコンプリートに対応しています。ここにPyxelアプリケーションのコードを記述します。デフォルトのエントリポイントは{0}です。",
      "ko": "코드 에디터는 Python 구문 하이라이팅과 자동 완성을 지원합니다. 여기에 Pyxel 애플리케이션 코드를 작성합니다. 기본 진입점은 {0}입니다.",
      "pt": "O editor de código oferece destaque de sintaxe Python e autocompletar. Escreva o código da sua aplicação Pyxel aqui. O ponto de entrada padrão é {0}.",
      "ru": "Редактор кода обеспечивает подсветку синтаксиса Python и автодополнение. Пишите код приложения Pyxel здесь. Точка входа по умолчанию — {0}.",
      "tr": "Kod düzenleyici Python söz dizimi vurgulama ve otomatik tamamlama sağlar. Pyxel uygulama kodunuzu buraya yazın. Varsayılan giriş noktası {0}'dir.",
      "uk": "Редактор коду забезпечує підсвітку синтаксису Python та автодоповнення. Пишіть код застосунку Pyxel тут. Точка входу за замовчуванням — {0}."
    },
    "resource_title": {
      "en": "Resource Editor",
      "cn": "资源编辑器",
      "de": "Ressourcen-Editor",
      "es": "Editor de recursos",
      "fr": "Éditeur de ressources",
      "it": "Editor di risorse",
      "ja": "リソースエディタ",
      "ko": "리소스 에디터",
      "pt": "Editor de recursos",
      "ru": "Редактор ресурсов",
      "tr": "Kaynak Düzenleyici",
      "uk": "Редактор ресурсів"
    },
    "resource_body": {
      "en": "The resource editor is the same as Pyxel's built-in editor. It allows you to create and edit images, tilemaps, sounds, and music. The resource file name is fixed to {0}. The editor operates the same way as in a local Pyxel environment.",
      "cn": "资源编辑器与 Pyxel 内置编辑器相同。可以创建和编辑图像、地图、声音和音乐。资源文件名固定为 {0}。操作方式与本地 Pyxel 环境相同。",
      "de": "Der Ressourcen-Editor ist identisch mit Pyxels integriertem Editor. Er ermöglicht das Erstellen und Bearbeiten von Bildern, Tilemaps, Sounds und Musik. Der Ressourcen-Dateiname ist auf {0} festgelegt. Der Editor funktioniert wie in einer lokalen Pyxel-Umgebung.",
      "es": "El editor de recursos es el mismo que el editor integrado de Pyxel. Permite crear y editar imágenes, tilemaps, sonidos y música. El nombre del archivo de recursos es fijo: {0}. El editor funciona igual que en un entorno local de Pyxel.",
      "fr": "L'éditeur de ressources est identique à l'éditeur intégré de Pyxel. Il permet de créer et modifier des images, des tilemaps, des sons et de la musique. Le nom du fichier de ressources est fixé à {0}. L'éditeur fonctionne de la même manière que dans un environnement Pyxel local.",
      "it": "L'editor di risorse è lo stesso dell'editor integrato di Pyxel. Consente di creare e modificare immagini, tilemap, suoni e musica. Il nome del file di risorse è fisso: {0}. L'editor funziona come in un ambiente Pyxel locale.",
      "ja": "リソースエディタはPyxel内蔵のエディタと同じものです。画像・タイルマップ・サウンド・ミュージックの作成・編集が行えます。リソースファイル名は{0}に固定されています。操作方法はローカルのPyxel環境と同様です。",
      "ko": "리소스 에디터는 Pyxel 내장 에디터와 동일합니다. 이미지, 타일맵, 사운드, 음악을 생성 및 편집할 수 있습니다. 리소스 파일 이름은 {0}으로 고정되어 있습니다. 에디터는 로컬 Pyxel 환경과 동일하게 작동합니다.",
      "pt": "O editor de recursos é o mesmo que o editor integrado do Pyxel. Permite criar e editar imagens, tilemaps, sons e música. O nome do arquivo de recursos é fixo: {0}. O editor funciona da mesma forma que em um ambiente Pyxel local.",
      "ru": "Редактор ресурсов аналогичен встроенному редактору Pyxel. Позволяет создавать и редактировать изображения, тайлмапы, звуки и музыку. Имя файла ресурсов зафиксировано как {0}. Редактор работает так же, как в локальной среде Pyxel.",
      "tr": "Kaynak düzenleyici, Pyxel'in yerleşik düzenleyicisiyle aynıdır. Görüntüler, tilemap'ler, sesler ve müzik oluşturmanıza ve düzenlemenize olanak tanır. Kaynak dosya adı {0} olarak sabittir. Düzenleyici, yerel Pyxel ortamıyla aynı şekilde çalışır.",
      "uk": "Редактор ресурсів аналогічний вбудованому редактору Pyxel. Дозволяє створювати та редагувати зображення, тайлмапи, звуки та музику. Ім'я файлу ресурсів зафіксовано як {0}. Редактор працює так само, як у локальному середовищі Pyxel."
    },
    "runtime_title": {
      "en": "Runtime Screen",
      "cn": "运行画面",
      "de": "Ausführungsbildschirm",
      "es": "Pantalla de ejecución",
      "fr": "Écran d'exécution",
      "it": "Schermo di esecuzione",
      "ja": "実行画面",
      "ko": "실행 화면",
      "pt": "Tela de execução",
      "ru": "Экран выполнения",
      "tr": "Çalışma Ekranı",
      "uk": "Екран виконання"
    },
    "runtime_body": {
      "en": "The right side of the screen displays the running application. Click the Run button or press {0} to execute your code. If an error occurs, the error message is displayed as an overlay on the runtime screen.",
      "cn": "屏幕右侧显示运行中的应用程序。点击 Run 按钮或按 {0} 执行代码。如果发生错误，错误消息将以叠加层的形式显示在运行画面上。",
      "de": "Die rechte Seite des Bildschirms zeigt die laufende Anwendung. Klicken Sie auf Run oder drücken Sie {0}, um den Code auszuführen. Bei einem Fehler wird die Fehlermeldung als Overlay auf dem Ausführungsbildschirm angezeigt.",
      "es": "El lado derecho de la pantalla muestra la aplicación en ejecución. Haga clic en Run o presione {0} para ejecutar el código. Si ocurre un error, el mensaje se muestra como una superposición en la pantalla de ejecución.",
      "fr": "Le côté droit de l'écran affiche l'application en cours d'exécution. Cliquez sur Run ou appuyez sur {0} pour exécuter le code. En cas d'erreur, le message s'affiche en superposition sur l'écran d'exécution.",
      "it": "Il lato destro dello schermo mostra l'applicazione in esecuzione. Fare clic su Run o premere {0} per eseguire il codice. In caso di errore, il messaggio viene visualizzato come overlay sullo schermo di esecuzione.",
      "ja": "画面の右側にアプリケーションの実行結果が表示されます。Runボタンのクリックまたは{0}キーでコードを実行します。エラーが発生した場合、実行画面にエラーメッセージがオーバーレイ表示されます。",
      "ko": "화면 오른쪽에 실행 중인 애플리케이션이 표시됩니다. Run 버튼을 클릭하거나 {0}을 눌러 코드를 실행합니다. 오류가 발생하면 실행 화면에 오류 메시지가 오버레이로 표시됩니다.",
      "pt": "O lado direito da tela exibe a aplicação em execução. Clique em Run ou pressione {0} para executar o código. Se ocorrer um erro, a mensagem é exibida como uma sobreposição na tela de execução.",
      "ru": "В правой части экрана отображается запущенное приложение. Нажмите Run или {0} для выполнения кода. При возникновении ошибки сообщение отображается поверх экрана выполнения.",
      "tr": "Ekranın sağ tarafında çalışan uygulama görüntülenir. Kodu çalıştırmak için Run düğmesine tıklayın veya {0} tuşuna basın. Bir hata oluşursa, hata mesajı çalışma ekranında katman olarak görüntülenir.",
      "uk": "Права частина екрана відображає запущений застосунок. Натисніть Run або {0} для виконання коду. При виникненні помилки повідомлення відображається поверх екрана виконання."
    },
    "shortcuts_title": {
      "en": "Keyboard Shortcuts",
      "cn": "键盘快捷键",
      "de": "Tastenkombinationen",
      "es": "Atajos de teclado",
      "fr": "Raccourcis clavier",
      "it": "Scorciatoie da tastiera",
      "ja": "キーボードショートカット",
      "ko": "키보드 단축키",
      "pt": "Atalhos de teclado",
      "ru": "Горячие клавиши",
      "tr": "Klavye Kısayolları",
      "uk": "Гарячі клавіші"
    },
    "shortcuts_body": {
      "en": "The following keyboard shortcuts are available. On macOS, use Cmd instead of Ctrl.",
      "cn": "可以使用以下键盘快捷键。在 macOS 上，使用 Cmd 代替 Ctrl。",
      "de": "Die folgenden Tastenkombinationen sind verfügbar. Unter macOS verwenden Sie Cmd statt Ctrl.",
      "es": "Los siguientes atajos de teclado están disponibles. En macOS, use Cmd en lugar de Ctrl.",
      "fr": "Les raccourcis clavier suivants sont disponibles. Sur macOS, utilisez Cmd au lieu de Ctrl.",
      "it": "Sono disponibili le seguenti scorciatoie da tastiera. Su macOS, usare Cmd al posto di Ctrl.",
      "ja": "以下のキーボードショートカットが使用できます。macOSではCtrlの代わりにCmdを使用します。",
      "ko": "다음 키보드 단축키를 사용할 수 있습니다. macOS에서는 Ctrl 대신 Cmd를 사용합니다.",
      "pt": "Os seguintes atalhos de teclado estão disponíveis. No macOS, use Cmd em vez de Ctrl.",
      "ru": "Доступны следующие горячие клавиши. На macOS используйте Cmd вместо Ctrl.",
      "tr": "Aşağıdaki klavye kısayolları kullanılabilir. macOS'ta Ctrl yerine Cmd kullanın.",
      "uk": "Доступні такі гарячі клавіші. На macOS використовуйте Cmd замість Ctrl."
    },
    "th_shortcut": {
      "en": "Shortcut",
      "cn": "快捷键",
      "de": "Tastenkombination",
      "es": "Atajo",
      "fr": "Raccourci",
      "it": "Scorciatoia",
      "ja": "ショートカット",
      "ko": "단축키",
      "pt": "Atalho",
      "ru": "Сочетание клавиш",
      "tr": "Kısayol",
      "uk": "Клавіші"
    },
    "th_action": {
      "en": "Action",
      "cn": "操作",
      "de": "Aktion",
      "es": "Acción",
      "fr": "Action",
      "it": "Azione",
      "ja": "動作",
      "ko": "동작",
      "pt": "Ação",
      "ru": "Действие",
      "tr": "İşlem",
      "uk": "Дія"
    },
    "project_title": {
      "en": "Project Files",
      "cn": "项目文件",
      "de": "Projektdateien",
      "es": "Archivos de proyecto",
      "fr": "Fichiers de projet",
      "it": "File di progetto",
      "ja": "プロジェクトファイル",
      "ko": "프로젝트 파일",
      "pt": "Arquivos de projeto",
      "ru": "Файлы проекта",
      "tr": "Proje Dosyaları",
      "uk": "Файли проєкту"
    },
    "project_body_1": {
      "en": "Projects are saved as ZIP files containing {0} and {1}. You can load a previously saved project using the Load button.",
      "cn": "项目保存为包含 {0} 和 {1} 的 ZIP 文件。可以使用 Load 按钮加载之前保存的项目。",
      "de": "Projekte werden als ZIP-Dateien mit {0} und {1} gespeichert. Über die Schaltfläche Load können Sie ein zuvor gespeichertes Projekt laden.",
      "es": "Los proyectos se guardan como archivos ZIP que contienen {0} y {1}. Puede cargar un proyecto guardado previamente usando el botón Load.",
      "fr": "Les projets sont enregistrés sous forme de fichiers ZIP contenant {0} et {1}. Vous pouvez charger un projet précédemment enregistré avec le bouton Load.",
      "it": "I progetti vengono salvati come file ZIP contenenti {0} e {1}. È possibile caricare un progetto salvato in precedenza con il pulsante Load.",
      "ja": "プロジェクトは{0}と{1}を含むZIPファイルとして保存されます。Loadボタンで以前保存したプロジェクトを読み込めます。",
      "ko": "프로젝트는 {0}과 {1}을 포함하는 ZIP 파일로 저장됩니다. Load 버튼으로 이전에 저장한 프로젝트를 불러올 수 있습니다.",
      "pt": "Os projetos são salvos como arquivos ZIP contendo {0} e {1}. Você pode carregar um projeto salvo anteriormente usando o botão Load.",
      "ru": "Проекты сохраняются как ZIP-файлы, содержащие {0} и {1}. Ранее сохранённый проект можно загрузить кнопкой Load.",
      "tr": "Projeler {0} ve {1} içeren ZIP dosyaları olarak kaydedilir. Daha önce kaydedilmiş bir projeyi Load düğmesiyle yükleyebilirsiniz.",
      "uk": "Проєкти зберігаються як ZIP-файли, що містять {0} та {1}. Раніше збережений проєкт можна завантажити кнопкою Load."
    },
    "project_body_2": {
      "en": "The ZIP format is compatible with Pyxel's {0} format. Saved projects can also be run in a local Pyxel environment:",
      "cn": "该 ZIP 格式与 Pyxel 的 {0} 格式兼容。保存的项目也可以在本地 Pyxel 环境中运行：",
      "de": "Das ZIP-Format ist kompatibel mit Pyxels {0}-Format. Gespeicherte Projekte können auch in einer lokalen Pyxel-Umgebung ausgeführt werden:",
      "es": "El formato ZIP es compatible con el formato {0} de Pyxel. Los proyectos guardados también se pueden ejecutar en un entorno local de Pyxel:",
      "fr": "Le format ZIP est compatible avec le format {0} de Pyxel. Les projets enregistrés peuvent également être exécutés dans un environnement Pyxel local :",
      "it": "Il formato ZIP è compatibile con il formato {0} di Pyxel. I progetti salvati possono essere eseguiti anche in un ambiente Pyxel locale:",
      "ja": "このZIP形式はPyxelの{0}形式と互換性があります。保存したプロジェクトはローカルのPyxel環境でも実行できます：",
      "ko": "ZIP 형식은 Pyxel의 {0} 형식과 호환됩니다. 저장된 프로젝트는 로컬 Pyxel 환경에서도 실행할 수 있습니다:",
      "pt": "O formato ZIP é compatível com o formato {0} do Pyxel. Projetos salvos também podem ser executados em um ambiente Pyxel local:",
      "ru": "Формат ZIP совместим с форматом {0} Pyxel. Сохранённые проекты также можно запускать в локальной среде Pyxel:",
      "tr": "ZIP formatı, Pyxel'in {0} formatıyla uyumludur. Kaydedilen projeler yerel Pyxel ortamında da çalıştırılabilir:",
      "uk": "Формат ZIP сумісний із форматом {0} Pyxel. Збережені проєкти також можна запускати в локальному середовищі Pyxel:"
    }
  },
  "toolbar_items": [
    {
      "label": "Load",
      "desc": {
        "en": "Load a project file (ZIP format) from your computer.",
        "cn": "从计算机加载项目文件（ZIP 格式）。",
        "de": "Eine Projektdatei (ZIP-Format) vom Computer laden.",
        "es": "Cargar un archivo de proyecto (formato ZIP) desde su computadora.",
        "fr": "Charger un fichier de projet (format ZIP) depuis votre ordinateur.",
        "it": "Carica un file di progetto (formato ZIP) dal computer.",
        "ja": "コンピューターからプロジェクトファイル（ZIP形式）を読み込みます。",
        "ko": "컴퓨터에서 프로젝트 파일(ZIP 형식)을 불러옵니다.",
        "pt": "Carregar um arquivo de projeto (formato ZIP) do seu computador.",
        "ru": "Загрузить файл проекта (формат ZIP) с компьютера.",
        "tr": "Bilgisayarınızdan bir proje dosyası (ZIP formatı) yükleyin.",
        "uk": "Завантажити файл проєкту (формат ZIP) з комп'ютера."
      }
    },
    {
      "label": "Save",
      "desc": {
        "en": "Save the current project as a ZIP file.",
        "cn": "将当前项目保存为 ZIP 文件。",
        "de": "Das aktuelle Projekt als ZIP-Datei speichern.",
        "es": "Guardar el proyecto actual como archivo ZIP.",
        "fr": "Enregistrer le projet actuel en fichier ZIP.",
        "it": "Salva il progetto corrente come file ZIP.",
        "ja": "現在のプロジェクトをZIPファイルとして保存します。",
        "ko": "현재 프로젝트를 ZIP 파일로 저장합니다.",
        "pt": "Salvar o projeto atual como arquivo ZIP.",
        "ru": "Сохранить текущий проект как ZIP-файл.",
        "tr": "Mevcut projeyi ZIP dosyası olarak kaydedin.",
        "uk": "Зберегти поточний проєкт як ZIP-файл."
      }
    },
    {
      "label": "Code / Res",
      "desc": {
        "en": "Toggle the left pane between the code editor and resource editor.",
        "cn": "在代码编辑器和资源编辑器之间切换左侧面板。",
        "de": "Den linken Bereich zwischen Code-Editor und Ressourcen-Editor umschalten.",
        "es": "Alternar el panel izquierdo entre el editor de código y el editor de recursos.",
        "fr": "Basculer le panneau gauche entre l'éditeur de code et l'éditeur de ressources.",
        "it": "Commuta il pannello sinistro tra l'editor di codice e l'editor di risorse.",
        "ja": "左ペインのコードエディタとリソースエディタを切り替えます。",
        "ko": "왼쪽 패널의 코드 에디터와 리소스 에디터를 전환합니다.",
        "pt": "Alternar o painel esquerdo entre o editor de código e o editor de recursos.",
        "ru": "Переключить левую панель между редактором кода и редактором ресурсов.",
        "tr": "Sol paneli kod düzenleyici ve kaynak düzenleyici arasında değiştirin.",
        "uk": "Перемкнути ліву панель між редактором коду та редактором ресурсів."
      }
    },
    {
      "label": "Run",
      "desc": {
        "en": "Run the application. The current code and resources are applied, and the result is displayed on the runtime screen.",
        "cn": "运行应用程序。当前代码和资源将被应用，结果显示在运行画面上。",
        "de": "Die Anwendung ausführen. Der aktuelle Code und die Ressourcen werden angewendet und das Ergebnis auf dem Ausführungsbildschirm angezeigt.",
        "es": "Ejecutar la aplicación. Se aplican el código y los recursos actuales, y el resultado se muestra en la pantalla de ejecución.",
        "fr": "Exécuter l'application. Le code et les ressources actuels sont appliqués et le résultat s'affiche sur l'écran d'exécution.",
        "it": "Eseguire l'applicazione. Il codice e le risorse correnti vengono applicati e il risultato viene visualizzato sullo schermo di esecuzione.",
        "ja": "アプリケーションを実行します。現在のコードとリソースが反映され、結果が実行画面に表示されます。",
        "ko": "애플리케이션을 실행합니다. 현재 코드와 리소스가 적용되고 결과가 실행 화면에 표시됩니다.",
        "pt": "Executar a aplicação. O código e os recursos atuais são aplicados e o resultado é exibido na tela de execução.",
        "ru": "Запустить приложение. Текущий код и ресурсы применяются, результат отображается на экране выполнения.",
        "tr": "Uygulamayı çalıştırın. Mevcut kod ve kaynaklar uygulanır ve sonuç çalışma ekranında görüntülenir.",
        "uk": "Запустити застосунок. Поточний код та ресурси застосовуються, результат відображається на екрані виконання."
      }
    }
  ],
  "shortcuts": [
    {
      "key": "Ctrl(Cmd)+L",
      "action": {
        "en": "Load project",
        "cn": "加载项目",
        "de": "Projekt laden",
        "es": "Cargar proyecto",
        "fr": "Charger le projet",
        "it": "Carica progetto",
        "ja": "プロジェクトを読み込む",
        "ko": "프로젝트 불러오기",
        "pt": "Carregar projeto",
        "ru": "Загрузить проект",
        "tr": "Proje yükle",
        "uk": "Завантажити проєкт"
      }
    },
    {
      "key": "Ctrl(Cmd)+S",
      "action": {
        "en": "Save project",
        "cn": "保存项目",
        "de": "Projekt speichern",
        "es": "Guardar proyecto",
        "fr": "Enregistrer le projet",
        "it": "Salva progetto",
        "ja": "プロジェクトを保存する",
        "ko": "프로젝트 저장",
        "pt": "Salvar projeto",
        "ru": "Сохранить проект",
        "tr": "Proje kaydet",
        "uk": "Зберегти проєкт"
      }
    },
    {
      "key": "Ctrl(Cmd)+,",
      "action": {
        "en": "Toggle Code/Res editor",
        "cn": "切换 Code/Res 编辑器",
        "de": "Code/Res-Editor umschalten",
        "es": "Alternar editor Code/Res",
        "fr": "Basculer l'éditeur Code/Res",
        "it": "Commuta editor Code/Res",
        "ja": "Code/Resエディタを切り替える",
        "ko": "Code/Res 에디터 전환",
        "pt": "Alternar editor Code/Res",
        "ru": "Переключить редактор Code/Res",
        "tr": "Code/Res düzenleyiciyi değiştir",
        "uk": "Перемкнути редактор Code/Res"
      }
    },
    {
      "key": "Ctrl(Cmd)+Enter",
      "action": {
        "en": "Run application",
        "cn": "运行应用程序",
        "de": "Anwendung ausführen",
        "es": "Ejecutar aplicación",
        "fr": "Exécuter l'application",
        "it": "Esegui applicazione",
        "ja": "アプリケーションを実行する",
        "ko": "애플리케이션 실행",
        "pt": "Executar aplicação",
        "ru": "Запустить приложение",
        "tr": "Uygulamayı çalıştır",
        "uk": "Запустити застосунок"
      }
    },
    {
      "key": "Ctrl(Cmd)+.",
      "action": {
        "en": "Toggle left/right focus",
        "cn": "切换左/右焦点",
        "de": "Linken/rechten Fokus umschalten",
        "es": "Alternar enfoque izquierda/derecha",
        "fr": "Basculer le focus gauche/droite",
        "it": "Commuta focus sinistra/destra",
        "ja": "左右のフォーカスを切り替える",
        "ko": "좌/우 포커스 전환",
        "pt": "Alternar foco esquerda/direita",
        "ru": "Переключить фокус лево/право",
        "tr": "Sol/sağ odağı değiştir",
        "uk": "Перемкнути фокус ліво/право"
      }
    }
  ]
}
